Repository: fieldcure/fieldcure-assiststudio
Catalog: src/AssistStudio.Controls/Strings/*/Resources.resw
Source language: en_us
Languages: ko_kr

# Chat_Copy
source: Copy
ko_kr: 복사

# Chat_Copied
source: Copied!
ko_kr: 복사됨!

# Chat_Continue
source: ▶ Continue
ko_kr: ▶ 계속

# Chat_Code
source: code
ko_kr: 코드

# Chat_CopyPrompt
source: Copy prompt
ko_kr: 프롬프트 복사

# Chat_CopyMessage
source: Copy response
ko_kr: 답변 복사

# Chat_Edit
source: Edit
ko_kr: 편집

# Chat_Retry
source: Retry
ko_kr: 다시 시도

# Chat_CopyRequest
source: Copy Request
ko_kr: 요청 복사

# Chat_CopyResponse
source: Copy Response
ko_kr: 응답 복사

# Chat_Tokens
source: tokens
ko_kr: 토큰

# Chat_EditBranchHint
source: Editing this message will create a new conversation branch. Use the arrow navigation buttons to switch between branches. The current input bar settings (profile/model/tools) will be applied on send.
ko_kr: 이 메시지를 편집하면 새로운 대화 브랜치가 생성됩니다. 화살표 네비게이션 버튼을 사용하여 브랜치 간 전환할 수 있습니다. 전송 시 아래 입력창의 설정(프로필/모델/도구)이 적용됩니다.

# Chat_EditCancel
source: Cancel
ko_kr: 취소

# Chat_EditSave
source: Send
ko_kr: 전송

# Chat_ShowMore
source: Show more
ko_kr: 더 보기

# Chat_ShowLess
source: Show less
ko_kr: 간략히 보기

# Chat_ImageSave
source: Save image
ko_kr: 이미지 저장

# Chat_ImageCopy
source: Copy to clipboard
ko_kr: 클립보드에 복사

# Chat_ImageSaved
source: Image saved
ko_kr: 이미지 저장됨

# Chat_ImageCopied
source: Copied to clipboard
ko_kr: 클립보드에 복사됨

# Chat_Seconds
source: s
ko_kr: 초

# Chat_Minutes
source: m
ko_kr: 분

# Chat_Hours
source: h
ko_kr: 시간

# Chat_SummaryHeader
source: Conversation summary
ko_kr: 이전 대화 요약

# ComposeBar_Placeholder
source: Type a message...
ko_kr: 메시지를 입력하세요...

# ComposeBar_AskProvider
source: Ask {0}...
ko_kr: {0}에게 물어보기...

# Chat_RegenerateTitle
source: Regenerate title with {0}
ko_kr: {0}(으)로 제목 재생성

# ComposeBar_AttachTooltip
source: Attach file
ko_kr: 파일 첨부

# ComposeBar_StopTooltip
source: Stop generating
ko_kr: 생성 중지

# ComposeBar_SendTooltip
source: Send message
ko_kr: 메시지 전송

# ComposeBar_ToolsTooltip
source: Tools
ko_kr: 도구

# ComposeBar_EditBanner_Label
source: Editing message
ko_kr: 메시지 편집 중

# ComposeBar_EditBanner_CancelTooltip
source: Cancel edit (Esc)
ko_kr: 편집 취소 (Esc)

# ComposeBar_EditBanner_CancelName
source: Cancel edit
ko_kr: 편집 취소

# ComposeBar_SelectAll
source: Select all
ko_kr: 모두 선택

# ComposeBar_DeselectAll
source: Deselect all
ko_kr: 모두 해제

# ComposeBar_NoToolsEnabled
source: No tools or servers enabled. Add them in Profile settings.
ko_kr: 사용할 도구나 서버가 없습니다. 프로필 설정에서 추가하세요.

# ChatPanel_EditTitleTooltip
source: Edit title
ko_kr: 제목 편집

# ToolApproval_Approve
source: Allow
ko_kr: 허용

# ToolApproval_Reject
source: Reject
ko_kr: 거부

# ToolApproval_Prompt
source: Allow {0} to execute?
ko_kr: {0} 실행을 허용하시겠습니까?

# ToolApproval_NotePlaceholder
source: Additional instructions (optional)
ko_kr: 추가 지시사항 (선택)

# ToolApproval_ExpandTooltip
source: Show details
ko_kr: 상세 보기

# ToolApproval_CollapseTooltip
source: Hide details
ko_kr: 상세 숨기기

# ToolApproval_ExpandName
source: Show tool approval details
ko_kr: 도구 승인 상세 보기

# ToolApproval_UserNoteName
source: Additional instructions
ko_kr: 추가 지시사항

# ToolElicitation_Prompt
source: {0} requires input
ko_kr: {0} 입력이 필요합니다

# ToolElicitation_Skip
source: Skip
ko_kr: 건너뛰기

# ToolElicitation_Submit
source: Submit
ko_kr: 제출

# Chat_SearchPrevTooltip
source: Previous
ko_kr: 이전

# Chat_SearchNextTooltip
source: Next
ko_kr: 다음

# Chat_SearchCloseTooltip
source: Close search bar
ko_kr: 검색 바 닫기

# Chat_SearchPrevName
source: Previous result
ko_kr: 이전 결과

# Chat_SearchNextName
source: Next result
ko_kr: 다음 결과

# Chat_SearchCloseName
source: Close search
ko_kr: 검색 닫기

# Attachment_RemoveTooltip
source: Remove attachment
ko_kr: 첨부 파일 제거

# ChatPanel_TitleFolderTooltip
source: Workspace folders and knowledge base
ko_kr: 작업 폴더 및 지식 베이스

# ChatPanel_EditTitleName
source: Edit title
ko_kr: 제목 편집

# ChatPanel_RefreshTitleName
source: Refresh title
ko_kr: 제목 새로 고침

# ChatPanel_TitleFolderName
source: Workspace folders and knowledge base
ko_kr: 작업 폴더 및 지식 베이스

# ComposeBar_AttachName
source: Attach files
ko_kr: 파일 첨부

# ComposeBar_ToolsName
source: Tool options
ko_kr: 도구 옵션

# ComposeBar_SendName
source: Send message
ko_kr: 메시지 보내기

# ComposeBar_StopName
source: Stop generating
ko_kr: 생성 중지

# ComposeBar_AttachmentItem
source: Attachment: {0}
ko_kr: 첨부 파일: {0}

# ComposeBar_AttachmentUnsupportedTooltip
source: Unsupported image format — will not be sent
ko_kr: 지원하지 않는 이미지 형식 — 전송되지 않습니다

# FolderFlyout_RemoveFolderAccessibilityName
source: Remove folder: {0}
ko_kr: 폴더 제거: {0}

# ChatPanel_Greeting
source: How can I help you today?
ko_kr: 무엇을 도와드릴까요?

# Folder_Tooltip
source: Folder Settings
ko_kr: 폴더 설정

# Folder_Header
source: Workspace Folders
ko_kr: 작업 폴더

# Folder_AddButton
source: Add Folder
ko_kr: 폴더 추가

# Folder_Empty
source: (empty)
ko_kr: (비어 있음)

# Folder_DisabledHint
source: Read and write files in these folders.
ko_kr: 이 폴더의 파일을 읽고 쓸 수 있습니다.

# Folder_KbHeader
source: Knowledge Base
ko_kr: 지식베이스

# Folder_SetKb
source: Set Folder
ko_kr: 폴더 지정

# Folder_KbDisabledHint
source: Current profile does not have Knowledge Base enabled.
ko_kr: 현재 프로필에서 지식베이스가 활성화되어 있지 않습니다.

# Folder_ReindexKb
source: Re-index documents
ko_kr: 문서 재인덱싱

# Folder_CancelKbIndexing
source: Cancel indexing
ko_kr: 인덱싱 취소

# Folder_KbNoKbs
source: No knowledge bases. Create one in Settings.
ko_kr: 지식베이스가 없습니다. 설정에서 생성하세요.

# Folder_KbPlaceholder
source: Select knowledge base
ko_kr: 지식베이스 선택

# FolderFlyout_RemoveTooltip
source: Remove
ko_kr: 제거

# ChatPanel_ControlName
source: Chat panel
ko_kr: 채팅 패널

# ChatPanel_ControlHelpText
source: Conversation view with message list, composer, and attachments.
ko_kr: 메시지 목록, 입력창, 첨부를 포함한 대화 영역입니다.

# ComposeBar_ControlName
source: Message composer
ko_kr: 메시지 입력 영역

# AttachmentPreviewBar_ControlName
source: Attachment preview bar
ko_kr: 첨부 미리보기 영역

# ToolApprovalPanel_ControlName
source: Tool approval panel
ko_kr: 도구 승인 패널

# ToolApprovalPanel_ControlHelpText
source: Review and approve or reject the pending tool invocation before it runs.
ko_kr: 실행 전에 대기 중인 도구 호출을 검토하고 허용 또는 거부합니다.

# ToolElicitationPanel_ControlName
source: Tool input panel
ko_kr: 도구 입력 패널

# ToolElicitationPanel_ControlHelpText
source: Provide the values the tool requested, then submit to continue.
ko_kr: 도구가 요청한 값을 입력한 후 제출하여 계속 진행합니다.
